БукмекерскаяКонтора/src/Documents/ПополнениеДепозита/ПополнениеДепозита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПополнениеДепозита</name>
  <registerRecords>AccumulationRegister.Депозиты</registerRecords>
  <attributes>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

БукмекерскаяКонтора/src/AccumulationRegisters/Депозиты/Депозиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Депозиты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Игрок</name>
    <type>
      <types>CatalogRef.Игроки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БукмекерскаяКонтора/src/Documents/ПополнениеДепозита/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Депозиты Приход
	Движения.Депозиты.Записывать = Истина;
	Движение = Движения.Депозиты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Игрок = Игрок;
	Движение.Сумма = СуммаПлатежа

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
